package classification

var (
	Periods = []string{
		"小学",
		"初中",
		"高中",
	}
	Grades = map[string][]string{
		"小学": []string{"一年级", "二年级", "三年级", "四年级", "五年级", "六年级"},
		"初中": []string{"七年级", "八年级", "九年级"},
		"高中": []string{"必修", "选择性必修", "选修"},
	}

	Subjects = map[string][]string{
		"小学": []string{
			"习近平新时代中国特色社会主义思想学生读本",
			"道德与法治",
			"语文",
			"数学",
			"英语",
			"科学",
			"音乐",
			"体育与健康",
			"美术",
		},
		"初中": []string{
			"道德与法治",
			"语文",
			"数学",
			"英语",
			"物理",
			"化学",
			"生物学",
			"历史",
			"地理",
			"人文地理",
			"日语",
			"俄语",
			"音乐",
			"体育与健康",
			"美术",
		},
		"高中": []string{
			"思想政治",
			"语文",
			"数学",
			"英语",
			"物理",
			"化学",
			"生物学",
			"历史",
			"地理",
			"信息技术",
			"通用技术",
			"日语",
			"俄语",
			"音乐",
			"体育与健康",
			"美术",
		},
	}
)
